PX4/PX4-Autopilot/nuttx/arch/mips/src/pic32mx/pic32mx-ethernet.c
  /* Get the interrupt status (zero means no interrupts pending). */

  status = pic32mx_getreg(PIC32MX_ETH_IRQ);
  if (status != 0)
    {
      /* Clear all pending interrupts */

      pic32mx_putreg(status, PIC32MX_ETH_IRQCLR);

      /* Handle each pending interrupt **************************************/
      /* Receive Errors *****************************************************/
      /* RXOVFLW: Receive FIFO Over Flow Error.  RXOVFLW is set by the RXBM
       * Logic for an RX FIFO Overflow condition. It is cleared by either a
       * Reset or CPU write of a ‘1’ to the CLR register.
       */

      if ((status & ETH_INT_RXOVFLW) != 0)
        {
           nlldbg("RX Overrun. status: %08x\n", status);
           EMAC_STAT(priv, rx_errors);
           EMAC_STAT(priv, rx_ovflw);
        }

      /* RXBUFNA: Receive Buffer Not Available Interrupt.  This bit is set by
       * a RX Buffer Descriptor Overrun condition. It is cleared by either a
       * Reset or a CPU write of a ‘1’ to the CLR register.
       */

      if ((status & ETH_INT_RXBUFNA) != 0)
        {
          nlldbg("RX buffer descriptor overrun. status: %08x\n", status);
          EMAC_STAT(priv, rx_errors);
          EMAC_STAT(priv, rx_bufna);
        }

      /* RXBUSE: Receive BVCI Bus Error Interrupt.  This bit is set when the
       * RX DMA encounters a BVCI Bus error during a memory access. It is
       * cleared by either a Reset or CPU write of a ‘1’ to the CLR register.
       */

      if ((status & ETH_INT_RXBUSE) != 0)
        {
          nlldbg("RX BVCI bus error. status: %08x\n", status);
          EMAC_STAT(priv, rx_errors);
          EMAC_STAT(priv, rx_buse);
        }

      /* Receive Normal Events **********************************************/
      /* RXACT: Receive Activity Interrupt.  This bit is set whenever RX packet
       * data is stored in the RXBM FIFO. It is cleared by either a Reset or CPU
       * write of a ‘1’ to the CLR register.
       */

      /* PKTPEND: Packet Pending Interrupt.  This bit is set when the BUFCNT
       * counter has a value other than ‘0’. It is cleared by either a Reset
       * or by writing the BUFCDEC bit to decrement the BUFCNT counter.
       * Writing a ‘0’ or a ‘1’ has no effect.
       */

      /* RXDONE: Receive Done Interrupt.  This bit is set whenever an RX packet
       * is successfully received. It is cleared by either a Reset or CPU
       * write of a ‘1’ to the CLR register.
       */

      if ((status & ETH_INT_RXDONE) != 0)
        {
          EMAC_STAT(priv, rx_done);

          /* We have received at least one new incoming packet. */

          pic32mx_rxdone(priv);
        }

      /* Transmit Errors ****************************************************/
      /* TXABORT: Transmit Abort Condition Interrupt.  This bit is set when
       * the MAC aborts the transmission of a TX packet for one of the
       * following reasons:
       * - Jumbo TX packet abort
       * - Underrun abort
       * - Excessive defer abort
       * - Late collision abort
       * - Excessive collisions abort
       * This bit is cleared by either a Reset or CPU write of a ‘1’ to the
       * CLR register.
       */

      if ((status & ETH_INT_TXABORT) != 0)
        {
          nlldbg("TX abort. status: %08x\n", status);
          EMAC_STAT(priv, tx_errors);
          EMAC_STAT(priv, tx_abort);
        }

      /* TXBUSE: Transmit BVCI Bus Error Interrupt. This bit is set when the
       * TX DMA encounters a BVCI Bus error during a memory access. It is
       * cleared by either a Reset or CPU write of a ‘1’ to the CLR register.
       */

      if ((status & ETH_INT_TXBUSE) != 0)
        {
          nlldbg("TX BVCI bus error. status: %08x\n", status);
          EMAC_STAT(priv, tx_errors);
          EMAC_STAT(priv, tx_buse);
        }

      /* TXDONE: Transmit Done Interrupt.  This bit is set when the currently
       * transmitted TX packet completes transmission, and the Transmit
       * Status Vector is loaded into the first descriptor used for the
       * packet. It is cleared by either a Reset or CPU write of a ‘1’ to
       * the CLR register.
       */

      if ((status & ETH_INT_TXDONE) != 0)
        {
          EMAC_STAT(priv, tx_done);

          /* A packet transmission just completed */

          pic32mx_txdone(priv);
        }

      /* Watermark Events ***************************************************/
      /* EWMARK: Empty Watermark Interrupt.  This bit is set when the RX
       * Descriptor Buffer Count is less than or equal to the value in the
       * RXEWM bit (ETHRXWM:0-7) value. It is cleared by BUFCNT bit
       * (ETHSTAT:16-23) being incremented by hardware. Writing a ‘0’ or a ‘1’
       * has no effect.
       */

      /* FWMARK: Full Watermark Interrupt.  This bit is set when the RX 
       * escriptor Buffer Count is greater than or equal to the value in the
       * RXFWM bit (ETHRXWM:16-23) field. It is cleared by writing the BUFCDEC
       * (ETHCON1:0) bit to decrement the BUFCNT counter. Writing a ‘0’ or a
       * ‘1’ has no effect.
       */

    }

  /* Clear the pending interrupt */

# if CONFIG_PIC32MX_NINTERFACES > 1
  up_clrpend_irq(priv->pd_irqsrc);
# else
  up_clrpend_irq(PIC32MX_IRQSRC_ETH);
# endif

  return OK;
}

/****************************************************************************
 * Function: pic32mx_txtimeout
 *
 * Description:
 *   Our TX watchdog timed out.  Called from the timer interrupt handler.
 *   The last TX never completed.  Reset the hardware and start again.
 *
 * Parameters:
 *   argc - The number of available arguments
 *   arg  - The first argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Global interrupts are disabled by the watchdog logic.
 *
 ****************************************************************************/

static void pic32mx_txtimeout(int argc, uint32_t arg, ...)
{
  struct pic32mx_driver_s *priv = (struct pic32mx_driver_s *)arg;

  /* Increment statistics and dump debug info */

  EMAC_STAT(priv, tx_timeouts);
  if (priv->pd_ifup)
    {
      /* Then reset the hardware. ifup() will reset the interface, then bring
       * it back up.
       */

      (void)pic32mx_ifup(&priv->pd_dev);

      /* Then poll uIP for new XMIT data (We are guaranteed to have a free
       * buffer here).
       */

      priv->pd_dev.d_buf = pic32mx_allocbuffer(priv);
      (void)uip_poll(&priv->pd_dev, pic32mx_uiptxpoll);

      /* Free any buffer left attached after the poll */

